app/controllers/api/v1/auth_controller.rb

    def create
        user = User.find_by(username: auth_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Jack"], ["LIMIT", 1]]

    def show
        @user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]