app/controllers/api/v1/collectables_controller.rb

SELECT "collectables".* FROM "collectables"
---
    def index
        @collectables = Collectable.all

SELECT "collectables".* FROM "collectables" WHERE "collectables"."name" = $1 LIMIT $2  [["name", "1"], ["LIMIT", 1]]
---
    def show
        @collectable = Collectable.find_by(name: params[:id])