app/controllers/api/v1/fish_controller.rb

    def index
        @fishes = Fish.all
---
SELECT "fish".* FROM "fish"