app/controllers/api/v1/fossils_controller.rb

    def index
        @fossils = Fossil.all
---
SELECT "fossils".* FROM "fossils"