app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.valid?
      @user.save
      @dailychecklist = Dailychecklist.create(user_id: @user.id, checked_statuses: "false,false,false,false,false,false][false,false,false][false,false][false][false,false][false,false,false,false,false][false,false,false,false,false,false,false,false,false,false")