app/controllers/api/v1/villagers_controller.rb

    def index
        @villagers = Villager.all
---
SELECT "villagers".* FROM "villagers"